       identification division.
       program-id. balance.
       
       data division.
       working-storage section.
       01 account-id pic x(10).
       01 account-balance pic 9(9)v999

       procedure division.

           accept account-id        

