       IDENTIFICATION DIVISION.
       PROGRAM-ID. BALANCE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 ACCOUNT-ID        PIC X(10).
       01 ACCOUNT-BALANCE   PIC 9(9)V99.

       PROCEDURE DIVISION.

           ACCEPT ACCOUNT-ID
           ACCEPT ACCOUNT-BALANCE

           DISPLAY "ACCOUNT: " ACCOUNT-ID
           DISPLAY "BALANCE: " ACCOUNT-BALANCE

           STOP RUN.

       END PROGRAM BALANCE.